cleanli2/stm32f407ve/Core/Src/camera.c
static void init_rgb565_qvga_12fps(void)
{
	sensor_write_reg(0x12, 0x80);
	udelay(5000);
	sensor_write_reg(0x11, 0x83);
	sensor_write_reg(0x9e, 0x29);
	sensor_write_reg(0x3b, 0x02);
	sensor_write_reg(0x13, 0xf2);
	sensor_write_reg(0x00, 0x00);
	sensor_write_reg(0x10, 0x00);
	sensor_write_reg(0x01, 0x80);
	sensor_write_reg(0x02, 0x80);
	sensor_write_reg(0x13, 0xf7);
	//
//	sensor_write_reg(0x12, 0x15);
	sensor_write_reg(0x12, 0x14); // modified by me
	sensor_write_reg(0x04, 0x00);
	sensor_write_reg(0x0c, 0x04);
	sensor_write_reg(0x18, 0x4A);
	sensor_write_reg(0x17, 0x22);
	sensor_write_reg(0x32, 0x89);
	sensor_write_reg(0x19, 0x02);
	sensor_write_reg(0x1a, 0x7a);
	sensor_write_reg(0x03, 0x00);
	//
	sensor_write_reg(0x0e, 0x84);
	sensor_write_reg(0x0f, 0x62);
	sensor_write_reg(0x15, 0x02);
	sensor_write_reg(0x1b, 0x01);
	sensor_write_reg(0x1e, 0x01);
	sensor_write_reg(0x29, 0x3c);
	sensor_write_reg(0x33, 0x00);
	sensor_write_reg(0x34, 0x07);
	sensor_write_reg(0x35, 0x84);
	sensor_write_reg(0x36, 0x00);
	sensor_write_reg(0x38, 0x13);
	sensor_write_reg(0x39, 0x43);
	sensor_write_reg(0x3c, 0x68);
	sensor_write_reg(0x3d, 0x19);
//	sensor_write_reg(0x40, 0xc1);
	sensor_write_reg(0x40, 0xd1); // modified by me
	sensor_write_reg(0x69, 0x80);
	sensor_write_reg(0x6b, 0x0a);
	sensor_write_reg(0xa1, 0x08);
	//
	sensor_write_reg(0x8b, 0xcc);
	sensor_write_reg(0x8c, 0xcc);
	sensor_write_reg(0x8d, 0xcf);
	//
	sensor_write_reg(0x14, 0x2e);
	sensor_write_reg(0x25, 0x58);
	sensor_write_reg(0x24, 0x68);
}

static void init_yuv_12fps(void)
{
	sensor_write_reg(0x11, 0x00);
	sensor_write_reg(0x92, 0x66);
	sensor_write_reg(0x93, 0x00);
	sensor_write_reg(0x9d, 0x4c);
	sensor_write_reg(0x9e, 0x3f);
	sensor_write_reg(0x3b, 0x0a);
	sensor_write_reg(0x13, 0xf0);
	sensor_write_reg(0x10, 0x00);
	sensor_write_reg(0x00, 0x00);
//	sensor_write_reg(0x00, 0xff); // modified by me
//	sensor_write_reg(0x07, 0x3f); // added by me
	sensor_write_reg(0x01, 0x80);
	sensor_write_reg(0x02, 0x80);
	sensor_write_reg(0x13, 0xf5);
	//
	sensor_write_reg(0x12, 0x00);
	sensor_write_reg(0x04, 0x00);
	sensor_write_reg(0x18, 0x01);
	sensor_write_reg(0x17, 0x13);
	sensor_write_reg(0x32, 0x92);
	sensor_write_reg(0x19, 0x02);
	sensor_write_reg(0x1a, 0x7a);
	sensor_write_reg(0x03, 0x00);
	//
	sensor_write_reg(0x0e, 0x84);
	sensor_write_reg(0x0f, 0x62);
	sensor_write_reg(0x15, 0x02);
	sensor_write_reg(0x16, 0x02);
	sensor_write_reg(0x1b, 0x01);
	sensor_write_reg(0x1e, 0x01);
	sensor_write_reg(0x29, 0x3c);
	sensor_write_reg(0x33, 0x00);
	sensor_write_reg(0x34, 0x07);
	sensor_write_reg(0x35, 0x84);
	sensor_write_reg(0x36, 0x00);
	sensor_write_reg(0x38, 0x13);
	sensor_write_reg(0x39, 0x43);
	sensor_write_reg(0x3a, 0x00);
	sensor_write_reg(0x3c, 0x6c);
	sensor_write_reg(0x3d, 0x90);
	sensor_write_reg(0x3f, 0x29);
	sensor_write_reg(0x40, 0xc1);
	sensor_write_reg(0x41, 0x20);
	sensor_write_reg(0x6b, 0x0a);
	sensor_write_reg(0xa1, 0xc8);
	//
	sensor_write_reg(0x69, 0x80);
	sensor_write_reg(0x43, 0xf0);
	sensor_write_reg(0x44, 0x10);
	sensor_write_reg(0x45, 0x78);
	sensor_write_reg(0x46, 0xa8);
	sensor_write_reg(0x47, 0x60);
	sensor_write_reg(0x48, 0x80);
	sensor_write_reg(0x59, 0xba);
	sensor_write_reg(0x5a, 0x9a);
	sensor_write_reg(0x5b, 0x22);
	sensor_write_reg(0x5c, 0xb9);
	sensor_write_reg(0x5d, 0x9b);
	sensor_write_reg(0x5e, 0x10);
	sensor_write_reg(0x5f, 0xe0);
	sensor_write_reg(0x60, 0x85);
	sensor_write_reg(0x61, 0x60);
	sensor_write_reg(0x9f, 0x9d);
	sensor_write_reg(0xa0, 0xa0);
	//
	sensor_write_reg(0x4f, 0x66);
	sensor_write_reg(0x50, 0x6b);
	sensor_write_reg(0x51, 0x05);
	sensor_write_reg(0x52, 0x19);
	sensor_write_reg(0x53, 0x40);
	sensor_write_reg(0x54, 0x59);
	sensor_write_reg(0x55, 0x40);
	sensor_write_reg(0x56, 0x40);
	sensor_write_reg(0x57, 0x40);
	sensor_write_reg(0x58, 0x0d);
	//
	sensor_write_reg(0x8b, 0xcc);
	sensor_write_reg(0x8c, 0xcc);
	sensor_write_reg(0x8d, 0xcf);
	//
	sensor_write_reg(0x6c, 0x40);
	sensor_write_reg(0x6d, 0x30);
	sensor_write_reg(0x6e, 0x4b);
	sensor_write_reg(0x6f, 0x60);
	sensor_write_reg(0x70, 0x70);
	sensor_write_reg(0x71, 0x70);
	sensor_write_reg(0x72, 0x70);
	sensor_write_reg(0x73, 0x70);
	sensor_write_reg(0x74, 0x60);
	sensor_write_reg(0x75, 0x60);
	sensor_write_reg(0x76, 0x50);
	sensor_write_reg(0x77, 0x48);
	sensor_write_reg(0x78, 0x3a);
	sensor_write_reg(0x79, 0x2e);
	sensor_write_reg(0x7a, 0x28);
	sensor_write_reg(0x7b, 0x22);
	sensor_write_reg(0x7c, 0x04);
	sensor_write_reg(0x7d, 0x07);
	sensor_write_reg(0x7e, 0x10);
	sensor_write_reg(0x7f, 0x28);
	sensor_write_reg(0x80, 0x36);
	sensor_write_reg(0x81, 0x44);
	sensor_write_reg(0x82, 0x52);
	sensor_write_reg(0x83, 0x60);
	sensor_write_reg(0x84, 0x6c);
	sensor_write_reg(0x85, 0x78);
	sensor_write_reg(0x86, 0x8c);
	sensor_write_reg(0x87, 0x9e);
	sensor_write_reg(0x88, 0xbb);
	sensor_write_reg(0x89, 0xd2);
	sensor_write_reg(0x8a, 0xe6);
	//
	sensor_write_reg(0x14, 0x1a);
	sensor_write_reg(0x24, 0x78);
	sensor_write_reg(0x25, 0x6c);
	sensor_write_reg(0x62, 0x00);
	sensor_write_reg(0x63, 0x00);
	sensor_write_reg(0x64, 0x18);
	sensor_write_reg(0x65, 0x30);
	sensor_write_reg(0x66, 0x05);
	sensor_write_reg(0x94, 0x18);
	sensor_write_reg(0x95, 0x1c);
	udelay(5000);
	sensor_write_reg(0x13, 0xf7);
}

static void init_yuv_25fps(void)
{
	sensor_write_reg(0x12, 0x80);
	udelay(5000);
	sensor_write_reg(0x11, 0x80);
	sensor_write_reg(0x92, 0x66);
	sensor_write_reg(0x93, 0x00);
	sensor_write_reg(0x9d, 0x4c);
	sensor_write_reg(0x9e, 0x3f);
	sensor_write_reg(0x3b, 0x00);
	sensor_write_reg(0x13, 0xf0);
	sensor_write_reg(0x10, 0xff);
	sensor_write_reg(0x00, 0xff);
	sensor_write_reg(0x01, 0x80);
	sensor_write_reg(0x02, 0x80);
	sensor_write_reg(0x13, 0xf5);
	//
	sensor_write_reg(0x12, 0x00);
	sensor_write_reg(0x04, 0x00);
	sensor_write_reg(0x18, 0x61);
	sensor_write_reg(0x17, 0x11);
	sensor_write_reg(0x32, 0x80);
	sensor_write_reg(0x19, 0x03);
	sensor_write_reg(0x1a, 0x7b);
	sensor_write_reg(0x03, 0x00);
	//
	sensor_write_reg(0x0e, 0x84);
	sensor_write_reg(0x0f, 0x62);
	sensor_write_reg(0x15, 0x00);
	sensor_write_reg(0x16, 0x02);
	sensor_write_reg(0x1b, 0x01);
	sensor_write_reg(0x1e, 0x31);
	sensor_write_reg(0x29, 0x3c);
	sensor_write_reg(0x33, 0x00);
	sensor_write_reg(0x34, 0x07);
	sensor_write_reg(0x35, 0x84);
	sensor_write_reg(0x36, 0x00);
	sensor_write_reg(0x38, 0x13);
	sensor_write_reg(0x39, 0x43);
	sensor_write_reg(0x3a, 0x0d);
	sensor_write_reg(0x3c, 0x6c);
	sensor_write_reg(0x3d, 0x90);
	sensor_write_reg(0x3f, 0x29);
	sensor_write_reg(0x40, 0xc0);
	sensor_write_reg(0x41, 0x20);
	sensor_write_reg(0x6b, 0x0a);
	sensor_write_reg(0xa1, 0xc8);
	//
	sensor_write_reg(0x69, 0x80);
	sensor_write_reg(0x43, 0xf0);
	sensor_write_reg(0x44, 0x10);
	sensor_write_reg(0x45, 0x78);
	sensor_write_reg(0x46, 0xa8);
	sensor_write_reg(0x47, 0x60);
	sensor_write_reg(0x48, 0x80);
	sensor_write_reg(0x59, 0xba);
	sensor_write_reg(0x5a, 0x9a);
	sensor_write_reg(0x5b, 0x22);
	sensor_write_reg(0x5c, 0xb9);
	sensor_write_reg(0x5d, 0x9b);
	sensor_write_reg(0x5e, 0x10);
	sensor_write_reg(0x5f, 0xe0);
	sensor_write_reg(0x60, 0x85);
	sensor_write_reg(0x61, 0x60);
	sensor_write_reg(0x9f, 0x9d);
	sensor_write_reg(0xa0, 0xa0);
	//
	sensor_write_reg(0x4f, 0x66);
	sensor_write_reg(0x50, 0x6b);
	sensor_write_reg(0x51, 0x05);
	sensor_write_reg(0x52, 0x19);
	sensor_write_reg(0x53, 0x40);
	sensor_write_reg(0x54, 0x59);
	sensor_write_reg(0x55, 0x40);
	sensor_write_reg(0x56, 0x40);
	sensor_write_reg(0x57, 0x40);
	sensor_write_reg(0x58, 0x0d);
	//
	sensor_write_reg(0x8b, 0xcc);
	sensor_write_reg(0x8c, 0xcc);
	sensor_write_reg(0x8d, 0xcf);
	//
	sensor_write_reg(0x6c, 0x40);
	sensor_write_reg(0x6d, 0x30);
	sensor_write_reg(0x6e, 0x4b);
	sensor_write_reg(0x6f, 0x60);
	sensor_write_reg(0x70, 0x3a);
	sensor_write_reg(0x71, 0x35);
	sensor_write_reg(0x72, 0x11);
	sensor_write_reg(0x73, 0x00);
	sensor_write_reg(0x74, 0x60);
	sensor_write_reg(0x75, 0x60);
	sensor_write_reg(0x76, 0x50);
	sensor_write_reg(0x77, 0x48);
	sensor_write_reg(0x78, 0x3a);
	sensor_write_reg(0x79, 0x2e);
	sensor_write_reg(0x7a, 0x28);
	sensor_write_reg(0x7b, 0x22);
	sensor_write_reg(0x7c, 0x04);
	sensor_write_reg(0x7d, 0x07);
	sensor_write_reg(0x7e, 0x10);
	sensor_write_reg(0x7f, 0x28);
	sensor_write_reg(0x80, 0x36);
	sensor_write_reg(0x81, 0x44);
	sensor_write_reg(0x82, 0x52);
	sensor_write_reg(0x83, 0x60);
	sensor_write_reg(0x84, 0x6c);
	sensor_write_reg(0x85, 0x78);
	sensor_write_reg(0x86, 0x8c);
	sensor_write_reg(0x87, 0x9e);
	sensor_write_reg(0x88, 0xbb);
	sensor_write_reg(0x89, 0xd2);
	sensor_write_reg(0x8a, 0xe6);
	//
	sensor_write_reg(0x14, 0x1a);
	sensor_write_reg(0x24, 0x7b);
	sensor_write_reg(0x25, 0x6c);
	sensor_write_reg(0x26, 0xc4);
	//
	sensor_write_reg(0x62, 0x00);
	sensor_write_reg(0x63, 0x00);
	sensor_write_reg(0x64, 0x18);
	sensor_write_reg(0x65, 0x30);
	sensor_write_reg(0x66, 0x05);
	sensor_write_reg(0x94, 0x18);
	sensor_write_reg(0x95, 0x1c);
	udelay(4000);
	sensor_write_reg(0x13, 0xf7);
}

void set_OV7670reg_M(void)//setting already change to rgb565, modify 0x40 & 0x12
{
	cam_w_reg(0x8c, 0x00);
	cam_w_reg(0x3a, 0x0c);//--------uyvy
	cam_w_reg(0x40, 0xd0);//----565
	cam_w_reg(0x8c, 0x00);
	cam_w_reg(0x12, 0x04);//------RGB-----------
	cam_w_reg(0x32, 0x80);
	cam_w_reg(0x17, 0x16);
	cam_w_reg(0x18, 0x04);
	cam_w_reg(0x19, 0x03);
	cam_w_reg(0x1a, 0x7b);
	cam_w_reg(0x03, 0x00);
	cam_w_reg(0x0c, 0x00);//----------------
	cam_w_reg(0x3e, 0x00);
	cam_w_reg(0x70, 0x3a);
	cam_w_reg(0x71, 0x35); 
	cam_w_reg(0x72, 0x11); 
	cam_w_reg(0x73, 0x00);
	cam_w_reg(0xa2, 0x00);
	cam_w_reg(0x11, 0x80);//-----------
	//cam_w_reg(0x15 , 0x31);
	cam_w_reg(0x7a, 0x20); 
	cam_w_reg(0x7b, 0x1c); 
	cam_w_reg(0x7c, 0x28); 
	cam_w_reg(0x7d, 0x3c);
	cam_w_reg(0x7e, 0x55); 
	cam_w_reg(0x7f, 0x68); 
	cam_w_reg(0x80, 0x76);
	cam_w_reg(0x81, 0x80); 
	cam_w_reg(0x82, 0x88);
	cam_w_reg(0x83, 0x8f);
	cam_w_reg(0x84, 0x96); 
	cam_w_reg(0x85, 0xa3);
	cam_w_reg(0x86, 0xaf);
	cam_w_reg(0x87, 0xc4); 
	cam_w_reg(0x88, 0xd7);
	cam_w_reg(0x89, 0xe8);
	 
	cam_w_reg(0x32,0xb6);
	
	cam_w_reg(0x13, 0xff); 
	cam_w_reg(0x00, 0x00);
	cam_w_reg(0x10, 0x00);
	cam_w_reg(0x0d, 0x00);
	cam_w_reg(0x14, 0x4e);
	cam_w_reg(0xa5, 0x05);
	cam_w_reg(0xab, 0x07); 
	cam_w_reg(0x24, 0x75);
	cam_w_reg(0x25, 0x63);
	cam_w_reg(0x26, 0xA5);
	cam_w_reg(0x9f, 0x78);
	cam_w_reg(0xa0, 0x68);
//	cam_w_reg(0xa1, 0x03);//0x0b,
	cam_w_reg(0xa6, 0xdf);
	cam_w_reg(0xa7, 0xdf);
	cam_w_reg(0xa8, 0xf0); 
	cam_w_reg(0xa9, 0x90); 
	cam_w_reg(0xaa, 0x94); 
	//cam_w_reg(0x13, 0xe5); 
	cam_w_reg(0x0e, 0x61);
	cam_w_reg(0x0f, 0x43);
	cam_w_reg(0x16, 0x02); 
	cam_w_reg(0x1e, 0x07);
	cam_w_reg(0x21, 0x02);
	cam_w_reg(0x22, 0x91);
	cam_w_reg(0x29, 0x07);
	cam_w_reg(0x33, 0x0b);
	cam_w_reg(0x35, 0x0b);
	cam_w_reg(0x37, 0x3f);
	cam_w_reg(0x38, 0x01);
	cam_w_reg(0x39, 0x00);
	cam_w_reg(0x3c, 0x78);
	cam_w_reg(0x4d, 0x40);
	cam_w_reg(0x4e, 0x20);
	cam_w_reg(0x69, 0x00);
	cam_w_reg(0x6b, 0x0a);//--------------------
	cam_w_reg(0x74, 0x19);
	cam_w_reg(0x8d, 0x4f);
	cam_w_reg(0x8e, 0x00);
	cam_w_reg(0x8f, 0x00);
	cam_w_reg(0x90, 0x00);
	cam_w_reg(0x91, 0x00);
	cam_w_reg(0x92, 0x00);
	cam_w_reg(0x96, 0x00);
	cam_w_reg(0x9a, 0x80);
	cam_w_reg(0xb0, 0x84);
	cam_w_reg(0xb1, 0x0c);
	cam_w_reg(0xb2, 0x0e);
	cam_w_reg(0xb3, 0x82);
	cam_w_reg(0xb8, 0x0a);
	cam_w_reg(0x43, 0x14);
	cam_w_reg(0x44, 0xf0);
	cam_w_reg(0x45, 0x34);
	cam_w_reg(0x46, 0x58);
	cam_w_reg(0x47, 0x28);
	cam_w_reg(0x48, 0x3a);
	
