cleanli2/stm32f407ve/Core/Src/camera.c
	cam_w_reg(0x59, 0x88);
	cam_w_reg(0x5a, 0x88);
	cam_w_reg(0x5b, 0x44);
	cam_w_reg(0x5c, 0x67);
	cam_w_reg(0x5d, 0x49);
	cam_w_reg(0x5e, 0x0e);
	
	cam_w_reg(0x64, 0x04);
	cam_w_reg(0x65, 0x20);
	cam_w_reg(0x66, 0x05);

	cam_w_reg(0x94, 0x04);
	cam_w_reg(0x95, 0x08);	 

	cam_w_reg(0x6c, 0x0a);
	cam_w_reg(0x6d, 0x55);
	cam_w_reg(0x6e, 0x11);
	cam_w_reg(0x6f, 0x9f); 

	cam_w_reg(0x6a, 0x40);
	cam_w_reg(0x01, 0x40);
	cam_w_reg(0x02, 0x40);
	
	//cam_w_reg(0x13, 0xe7);
	cam_w_reg(0x15, 0x00);
	cam_w_reg(0x4f, 0x80);
	cam_w_reg(0x50, 0x80);
	cam_w_reg(0x51, 0x00);
	cam_w_reg(0x52, 0x22);
	cam_w_reg(0x53, 0x5e);
	cam_w_reg(0x54, 0x80);
	cam_w_reg(0x58, 0x9e);

	cam_w_reg(0x41, 0x08);
	cam_w_reg(0x3f, 0x00);
	cam_w_reg(0x75, 0x05);
	cam_w_reg(0x76, 0xe1);

	cam_w_reg(0x4c, 0x00);
	cam_w_reg(0x77, 0x01);
	
	cam_w_reg(0x3d, 0xc0);//-------uyvy
	cam_w_reg(0x4b, 0x09);
	cam_w_reg(0xc9, 0x60);
	//cam_w_reg(0x41, 0x38);	
	cam_w_reg(0x56, 0x40);
	cam_w_reg(0x34, 0x11);
	cam_w_reg(0x3b, 0x02);
	cam_w_reg(0xa4, 0x89);
	
	cam_w_reg(0x96, 0x00);
	cam_w_reg(0x97, 0x30);
	cam_w_reg(0x98, 0x20);
	cam_w_reg(0x99, 0x30);
	cam_w_reg(0x9a, 0x84);
	cam_w_reg(0x9b, 0x29);
	cam_w_reg(0x9c, 0x03);
	cam_w_reg(0x9d, 0x4c);
	cam_w_reg(0x9e, 0x3f);	

	cam_w_reg(0x09, 0x00);
	//cam_w_reg(0x3b, 0xc2);//night mode

}
void set_OV7670reg(void)
{
	cam_w_reg(0x8c, 0x00);
	cam_w_reg(0x3a, 0x04);
	cam_w_reg(0x40, 0xd0);
	cam_w_reg(0x8c, 0x00);
	cam_w_reg(0x12, 0x14);
	cam_w_reg(0x32, 0x80);
	cam_w_reg(0x17, 0x16);
	cam_w_reg(0x18, 0x04);
	cam_w_reg(0x19, 0x02);
	cam_w_reg(0x1a, 0x7b);
	cam_w_reg(0x03, 0x06);
	cam_w_reg(0x0c, 0x04);
	cam_w_reg(0x3e, 0x00);
	cam_w_reg(0x70, 0x3a);
	cam_w_reg(0x71, 0x35); 
	cam_w_reg(0x72, 0x11); 
	cam_w_reg(0x73, 0x00);
	cam_w_reg(0xa2, 0x00);
	cam_w_reg(0x11, 0xff); 
	//cam_w_reg(0x15 , 0x31);
	cam_w_reg(0x7a, 0x20); 
	cam_w_reg(0x7b, 0x1c); 
	cam_w_reg(0x7c, 0x28); 
	cam_w_reg(0x7d, 0x3c);
	cam_w_reg(0x7e, 0x55); 
	cam_w_reg(0x7f, 0x68); 
	cam_w_reg(0x80, 0x76);
	cam_w_reg(0x81, 0x80); 
	cam_w_reg(0x82, 0x88);
	cam_w_reg(0x83, 0x8f);
	cam_w_reg(0x84, 0x96); 
	cam_w_reg(0x85, 0xa3);
	cam_w_reg(0x86, 0xaf);
	cam_w_reg(0x87, 0xc4); 
	cam_w_reg(0x88, 0xd7);
	cam_w_reg(0x89, 0xe8);
	 
	cam_w_reg(0x32,0xb6);
	
	cam_w_reg(0x13, 0xff); 
	cam_w_reg(0x00, 0x00);
	cam_w_reg(0x10, 0x00);
	cam_w_reg(0x0d, 0x00);
	cam_w_reg(0x14, 0x4e);
	cam_w_reg(0xa5, 0x05);
	cam_w_reg(0xab, 0x07); 
	cam_w_reg(0x24, 0x75);
	cam_w_reg(0x25, 0x63);
	cam_w_reg(0x26, 0xA5);
	cam_w_reg(0x9f, 0x78);
	cam_w_reg(0xa0, 0x68);
//	cam_w_reg(0xa1, 0x03);//0x0b,
	cam_w_reg(0xa6, 0xdf);
	cam_w_reg(0xa7, 0xdf);
	cam_w_reg(0xa8, 0xf0); 
	cam_w_reg(0xa9, 0x90); 
	cam_w_reg(0xaa, 0x94); 
	//cam_w_reg(0x13, 0xe5); 
	cam_w_reg(0x0e, 0x61);
	cam_w_reg(0x0f, 0x43);
	cam_w_reg(0x16, 0x02); 
	cam_w_reg(0x1e, 0x37);
	cam_w_reg(0x21, 0x02);
	cam_w_reg(0x22, 0x91);
	cam_w_reg(0x29, 0x07);
	cam_w_reg(0x33, 0x0b);
	cam_w_reg(0x35, 0x0b);
	cam_w_reg(0x37, 0x3f);
	cam_w_reg(0x38, 0x01);
	cam_w_reg(0x39, 0x00);
	cam_w_reg(0x3c, 0x78);
	cam_w_reg(0x4d, 0x40);
	cam_w_reg(0x4e, 0x20);
	cam_w_reg(0x69, 0x00);
	cam_w_reg(0x6b, 0x4a);
	cam_w_reg(0x74, 0x19);
	cam_w_reg(0x8d, 0x4f);
	cam_w_reg(0x8e, 0x00);
	cam_w_reg(0x8f, 0x00);
	cam_w_reg(0x90, 0x00);
	cam_w_reg(0x91, 0x00);
	cam_w_reg(0x92, 0x00);
	cam_w_reg(0x96, 0x00);
	cam_w_reg(0x9a, 0x80);
	cam_w_reg(0xb0, 0x84);
	cam_w_reg(0xb1, 0x0c);
	cam_w_reg(0xb2, 0x0e);
	cam_w_reg(0xb3, 0x82);
	cam_w_reg(0xb8, 0x0a);
	cam_w_reg(0x43, 0x14);
	cam_w_reg(0x44, 0xf0);
	cam_w_reg(0x45, 0x34);
	cam_w_reg(0x46, 0x58);
	cam_w_reg(0x47, 0x28);
	cam_w_reg(0x48, 0x3a);
	
	cam_w_reg(0x59, 0x88);
	cam_w_reg(0x5a, 0x88);
	cam_w_reg(0x5b, 0x44);
	cam_w_reg(0x5c, 0x67);
	cam_w_reg(0x5d, 0x49);
	cam_w_reg(0x5e, 0x0e);
	
	cam_w_reg(0x64, 0x04);
	cam_w_reg(0x65, 0x20);
	cam_w_reg(0x66, 0x05);

	cam_w_reg(0x94, 0x04);
	cam_w_reg(0x95, 0x08);	 

	cam_w_reg(0x6c, 0x0a);
	cam_w_reg(0x6d, 0x55);
	cam_w_reg(0x6e, 0x11);
	cam_w_reg(0x6f, 0x9f); 

	cam_w_reg(0x6a, 0x40);
	cam_w_reg(0x01, 0x40);
	cam_w_reg(0x02, 0x40);
	
	//cam_w_reg(0x13, 0xe7);
	cam_w_reg(0x15, 0x00);
	cam_w_reg(0x4f, 0x80);
	cam_w_reg(0x50, 0x80);
	cam_w_reg(0x51, 0x00);
	cam_w_reg(0x52, 0x22);
	cam_w_reg(0x53, 0x5e);
	cam_w_reg(0x54, 0x80);
	cam_w_reg(0x58, 0x9e);

	cam_w_reg(0x41, 0x08);
	cam_w_reg(0x3f, 0x00);
	cam_w_reg(0x75, 0x05);
	cam_w_reg(0x76, 0xe1);

	cam_w_reg(0x4c, 0x00);
	cam_w_reg(0x77, 0x01);
	
	cam_w_reg(0x3d, 0xc1);
	cam_w_reg(0x4b, 0x09);
	cam_w_reg(0xc9, 0x60);
	//cam_w_reg(0x41, 0x38);	
	cam_w_reg(0x56, 0x40);
	cam_w_reg(0x34, 0x11);
	cam_w_reg(0x3b, 0x02);
	cam_w_reg(0xa4, 0x89);
	
	cam_w_reg(0x96, 0x00);
	cam_w_reg(0x97, 0x30);
	cam_w_reg(0x98, 0x20);
	cam_w_reg(0x99, 0x30);
	cam_w_reg(0x9a, 0x84);
	cam_w_reg(0x9b, 0x29);
	cam_w_reg(0x9c, 0x03);
	cam_w_reg(0x9d, 0x4c);
	cam_w_reg(0x9e, 0x3f);	

	cam_w_reg(0x09, 0x00);
	cam_w_reg(0x3b, 0xc2);

}
#endif


int cam_w_reg(uint8_t addr, uint8_t data)
{
    uint8_t d[2];
    d[0]=addr;
    d[1]=data;
    return HAL_I2C_Master_Transmit(&hi2c2, 0x42, d, 2, 1000000);
}
int cam_r_regn(uint8_t addr,uint8_t n,uint8_t * buf)
{
    return HAL_I2C_Master_Receive(&hi2c2, 0x42, buf, n, 1000000);
}
int camreaderr=0;
uint8_t cam_r_reg(uint8_t addr)
{
    uint8_t ret=0;
    camreaderr=HAL_I2C_Master_Transmit(&hi2c2, 0x42, &addr, 1, 1000000);
    if(0!=camreaderr){
        return 0;
    }
    camreaderr=cam_r_regn(addr, 1, &ret);
    if(camreaderr!=0)lprintf("cam read error\r\n");
    return ret;
}
int g_cam_r70p_e = 0;
int g_cam_r71p_e = 1;
int cam_init(int choose)
{
    int rcam_rty=9;
    uint8_t tmpd=0;
    //int choose=7;


    delay_ms(20);
    lprintf("cam reset return %x\r\n", cam_w_reg(0x12, 0x80));
    delay_ms(20);

    //read cam id
    while(1){
        tmpd=cam_r_reg(0x0A);
        prt_hex(tmpd);
        prt_hex(camreaderr);
        if(0x76==tmpd){
            lprintf("cam ID OK\r\n");
            break;
        }
        else{
            rcam_rty--;
            if(rcam_rty==0){
                lprintf("cam ID fail\r\n");
                return -1;
            }
        }
        delay_ms(10);
    }
    lprintf("cam read 0x0A=%b\r\n", cam_r_reg(0x0A));
    lprintf("cam read 0x0B=%b\r\n", cam_r_reg(0x0B));
    switch(choose){
        case 1:
            lprintf_time("set_OV7670reg\r\n");
            set_OV7670reg();
            break;
            //OV7670_config_window(272,12,320,240);//
        case 2:
            lprintf_time("init_rgb565_qvga_12fps\r\n");
            init_rgb565_qvga_12fps();
            break;
        case 3:
            lprintf_time("init_rgb565_qvga_25fps_new\r\n");
            init_rgb565_qvga_25fps_new();
            break;
        case 4:
            lprintf_time("init_rgb565_qvga_25fps\r\n");
            init_rgb565_qvga_25fps();
            break;
        case 5:
            lprintf_time("init_yuv_25fps\r\n");
            init_yuv_25fps();
            break;
        case 6:
            lprintf_time("init_yuv_12fps\r\n");
            init_yuv_12fps();
            break;
        case 7:
            lprintf_time("modified set_OV7670reg\r\n");
            set_OV7670reg_M();
            break;
        default:
            lprintf("cam w 0x1e return %x\r\n", cam_w_reg(0x1e, 0x30|cam_r_reg(0x1e)));
            lprintf_time("no init regs\r\n");
    }
    if(g_cam_r70p_e)lprintf("cam w 0x70 return %x\r\n", cam_w_reg(0x70, 0x80|cam_r_reg(0x70)));
    if(g_cam_r71p_e)lprintf("cam w 0x71 return %x\r\n", cam_w_reg(0x71, 0x80|cam_r_reg(0x71)));
    lprintf("cam read 0x12=%b\r\n", cam_r_reg(0x12));
    return 0;
}

void HAL_DCMI_ErrorCallback(DCMI_HandleTypeDef *hdcmi)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdcmi);
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_DCMI_ErrorCallback could be implemented in the user file
   */
  cam_dma_err=1;
}
void HAL_DCMI_LineEventCallback(DCMI_HandleTypeDef *hdcmi)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdcmi);
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_DCMI_LineEventCallback could be implemented in the user file
   */
  cam_linect++;
}

/**
  * @brief  VSYNC Event callback.
  * @param  hdcmi pointer to a DCMI_HandleTypeDef structure that contains
  *                the configuration information for DCMI.
  * @retval None
  */
__weak void HAL_DCMI_VsyncEventCallback(DCMI_HandleTypeDef *hdcmi)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdcmi);
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_DCMI_VsyncEventCallback could be implemented in the user file
   */
  cam_vsct++;
}

/**
  * @brief  Frame Event callback.
  * @param  hdcmi pointer to a DCMI_HandleTypeDef structure that contains
  *                the configuration information for DCMI.
  * @retval None
  */
__weak void HAL_DCMI_FrameEventCallback(DCMI_HandleTypeDef *hdcmi)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdcmi);
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_DCMI_FrameEventCallback could be implemented in the user file
   */
  cam_fmct++;
}
